// タイプの日本語変換
const typeJpn = {
    normal: 'ノーマル',
    fire: 'ほのお',
    water: 'みず',
    grass: 'くさ',
    electric: 'でんき',
    ice: 'こおり',
    fighting: 'かくとう',
    poison: 'どく',
    ground: 'じめん',
    flying: 'ひこう',
    psychic: 'エスパー',
    bug: 'むし',
    rock: 'いわ',
    ghost: 'ゴースト',
    dragon: 'ドラゴン',
    dark: 'あく',
    steel: 'はがね',
    fairy: 'フェアリー'
};

// 背景用のタイプ色
const colors = {
    normal: '#C6C6A7aa',
    fire: '#F5AC78aa',
    water: '#9DB7F5aa',
    grass: '#A7DB8Daa',
    electric: '#FAE078aa',
    ice: '#BCE6E6aa',
    fighting: '#D67873aa',
    poison: '#C183C1aa',
    ground: '#EBD69Daa',
    flying: '#C6B7F5aa',
    psychic: '#FA92B2aa',
    bug: '#C6D16Eaa',
    rock: '#D1C17Daa',
    ghost: '#A292BCaa',
    dragon: '#A27DFAaa',
    dark: '#A29288aa',
    steel: '#D1D1E0aa',
    fairy: '#F4BDC9aa'
}

// ポケモンの日本語名
const pokeNamesList = {
    "0001": "フシギダネ",
    "0002": "フシギソウ",
    "0003": "フシギバナ",
    "0004": "ヒトカゲ",
    "0005": "リザード",
    "0006": "リザードン",
    "0007": "ゼニガメ",
    "0008": "カメール",
    "0009": "カメックス",
    "0010": "キャタピー",
    "0011": "トランセル",
    "0012": "バタフリー",
    "0013": "ビードル",
    "0014": "コクーン",
    "0015": "スピアー",
    "0016": "ポッポ",
    "0017": "ピジョン",
    "0018": "ピジョット",
    "0019": "コラッタ",
    "0020": "ラッタ",
    "0021": "オニスズメ",
    "0022": "オニドリル",
    "0023": "アーボ",
    "0024": "アーボック",
    "0025": "ピカチュウ",
    "0026": "ライチュウ",
    "0027": "サンド",
    "0028": "サンドパン",
    "0029": "ニドラン♀",
    "0030": "ニドリーナ",
    "0031": "ニドクイン",
    "0032": "ニドラン♂",
    "0033": "ニドリーノ",
    "0034": "ニドキング",
    "0035": "ピッピ",
    "0036": "ピクシー",
    "0037": "ロコン",
    "0038": "キュウコン",
    "0039": "プリン",
    "0040": "プクリン",
    "0041": "ズバット",
    "0042": "ゴルバット",
    "0043": "ナゾノクサ",
    "0044": "クサイハナ",
    "0045": "ラフレシア",
    "0046": "パラス",
    "0047": "パラセクト",
    "0048": "コンパン",
    "0049": "モルフォン",
    "0050": "ディグダ",
    "0051": "ダグトリオ",
    "0052": "ニャース",
    "0053": "ペルシアン",
    "0054": "コダック",
    "0055": "ゴルダック",
    "0056": "マンキー",
    "0057": "オコリザル",
    "0058": "ガーディ",
    "0059": "ウインディ",
    "0060": "ニョロモ",
    "0061": "ニョロゾ",
    "0062": "ニョロボン",
    "0063": "ケーシィ",
    "0064": "ユンゲラー",
    "0065": "フーディン",
    "0066": "ワンリキー",
    "0067": "ゴーリキー",
    "0068": "カイリキー",
    "0069": "マダツボミ",
    "0070": "ウツドン",
    "0071": "ウツボット",
    "0072": "メノクラゲ",
    "0073": "ドククラゲ",
    "0074": "イシツブテ",
    "0075": "ゴローン",
    "0076": "ゴローニャ",
    "0077": "ポニータ",
    "0078": "ギャロップ",
    "0079": "ヤドン",
    "0080": "ヤドラン",
    "0081": "コイル",
    "0082": "レアコイル",
    "0083": "カモネギ",
    "0084": "ドードー",
    "0085": "ドードリオ",
    "0086": "パウワウ",
    "0087": "ジュゴン",
    "0088": "ベトベター",
    "0089": "ベトベトン",
    "0090": "シェルダー",
    "0091": "パルシェン",
    "0092": "ゴース",
    "0093": "ゴースト",
    "0094": "ゲンガー",
    "0095": "イワーク",
    "0096": "スリープ",
    "0097": "スリーパー",
    "0098": "クラブ",
    "0099": "キングラー",
    "0100": "ビリリダマ",
    "0101": "マルマイン",
    "0102": "タマタマ",
    "0103": "ナッシー",
    "0104": "カラカラ",
    "0105": "ガラガラ",
    "0106": "サワムラー",
    "0107": "エビワラー",
    "0108": "ベロリンガ",
    "0109": "ドガース",
    "0110": "マタドガス",
    "0111": "サイホーン",
    "0112": "サイドン",
    "0113": "ラッキー",
    "0114": "モンジャラ",
    "0115": "ガルーラ",
    "0116": "タッツー",
    "0117": "シードラ",
    "0118": "トサキント",
    "0119": "アズマオウ",
    "0120": "ヒトデマン",
    "0121": "スターミー",
    "0122": "バリヤード",
    "0123": "ストライク",
    "0124": "ルージュラ",
    "0125": "エレブー",
    "0126": "ブーバー",
    "0127": "カイロス",
    "0128": "ケンタロス",
    "0129": "コイキング",
    "0130": "ギャラドス",
    "0131": "ラプラス",
    "0132": "メタモン",
    "0133": "イーブイ",
    "0134": "シャワーズ",
    "0135": "サンダース",
    "0136": "ブースター",
    "0137": "ポリゴン",
    "0138": "オムナイト",
    "0139": "オムスター",
    "0140": "カブト",
    "0141": "カブトプス",
    "0142": "プテラ",
    "0143": "カビゴン",
    "0144": "フリーザー",
    "0145": "サンダー",
    "0146": "ファイヤー",
    "0147": "ミニリュウ",
    "0148": "ハクリュー",
    "0149": "カイリュー",
    "0150": "ミュウツー",
    "0151": "ミュウ",
    "0152": "チコリータ",
    "0153": "ベイリーフ",
    "0154": "メガニウム",
    "0155": "ヒノアラシ",
    "0156": "マグマラシ",
    "0157": "バクフーン",
    "0158": "ワニノコ",
    "0159": "アリゲイツ",
    "0160": "オーダイル",
    "0161": "オタチ",
    "0162": "オオタチ",
    "0163": "ホーホー",
    "0164": "ヨルノズク",
    "0165": "レディバ",
    "0166": "レディアン",
    "0167": "イトマル",
    "0168": "アリアドス",
    "0169": "クロバット",
    "0170": "チョンチー",
    "0171": "ランターン",
    "0172": "ピチュー",
    "0173": "ピィ",
    "0174": "ププリン",
    "0175": "トゲピー",
    "0176": "トゲチック",
    "0177": "ネイティ",
    "0178": "ネイティオ",
    "0179": "メリープ",
    "0180": "モココ",
    "0181": "デンリュウ",
    "0182": "キレイハナ",
    "0183": "マリル",
    "0184": "マリルリ",
    "0185": "ウソッキー",
    "0186": "ニョロトノ",
    "0187": "ハネッコ",
    "0188": "ポポッコ",
    "0189": "ワタッコ",
    "0190": "エイパム",
    "0191": "ヒマナッツ",
    "0192": "キマワリ",
    "0193": "ヤンヤンマ",
    "0194": "ウパー",
    "0195": "ヌオー",
    "0196": "エーフィ",
    "0197": "ブラッキー",
    "0198": "ヤミカラス",
    "0199": "ヤドキング",
    "0200": "ムウマ",
    "0201": "アンノーン",
    "0202": "ソーナンス",
    "0203": "キリンリキ",
    "0204": "クヌギダマ",
    "0205": "フォレトス",
    "0206": "ノコッチ",
    "0207": "グライガー",
    "0208": "ハガネール",
    "0209": "ブルー",
    "0210": "グランブル",
    "0211": "ハリーセン",
    "0212": "ハッサム",
    "0213": "ツボツボ",
    "0214": "ヘラクロス",
    "0215": "ニューラ",
    "0216": "ヒメグマ",
    "0217": "リングマ",
    "0218": "マグマッグ",
    "0219": "マグカルゴ",
    "0220": "ウリムー",
    "0221": "イノムー",
    "0222": "サニーゴ",
    "0223": "テッポウオ",
    "0224": "オクタン",
    "0225": "デリバード",
    "0226": "マンタイン",
    "0227": "エアームド",
    "0228": "デルビル",
    "0229": "ヘルガー",
    "0230": "キングドラ",
    "0231": "ゴマゾウ",
    "0232": "ドンファン",
    "0233": "ポリゴン２",
    "0234": "オドシシ",
    "0235": "ドーブル",
    "0236": "バルキー",
    "0237": "カポエラー",
    "0238": "ムチュール",
    "0239": "エレキッド",
    "0240": "ブビィ",
    "0241": "ミルタンク",
    "0242": "ハピナス",
    "0243": "ライコウ",
    "0244": "エンテイ",
    "0245": "スイクン",
    "0246": "ヨーギラス",
    "0247": "サナギラス",
    "0248": "バンギラス",
    "0249": "ルギア",
    "0250": "ホウオウ",
    "0251": "セレビィ",
    "0252": "キモリ",
    "0253": "ジュプトル",
    "0254": "ジュカイン",
    "0255": "アチャモ",
    "0256": "ワカシャモ",
    "0257": "バシャーモ",
    "0258": "ミズゴロウ",
    "0259": "ヌマクロー",
    "0260": "ラグラージ",
    "0261": "ポチエナ",
    "0262": "グラエナ",
    "0263": "ジグザグマ",
    "0264": "マッスグマ",
    "0265": "ケムッソ",
    "0266": "カラサリス",
    "0267": "アゲハント",
    "0268": "マユルド",
    "0269": "ドクケイル",
    "0270": "ハスボー",
    "0271": "ハスブレロ",
    "0272": "ルンパッパ",
    "0273": "タネボー",
    "0274": "コノハナ",
    "0275": "ダーテング",
    "0276": "スバメ",
    "0277": "オオスバメ",
    "0278": "キャモメ",
    "0279": "ペリッパー",
    "0280": "ラルトス",
    "0281": "キルリア",
    "0282": "サーナイト",
    "0283": "アメタマ",
    "0284": "アメモース",
    "0285": "キノココ",
    "0286": "キノガッサ",
    "0287": "ナマケロ",
    "0288": "ヤルキモノ",
    "0289": "ケッキング",
    "0290": "ツチニン",
    "0291": "テッカニン",
    "0292": "ヌケニン",
    "0293": "ゴニョニョ",
    "0294": "ドゴーム",
    "0295": "バクオング",
    "0296": "マクノシタ",
    "0297": "ハリテヤマ",
    "0298": "ルリリ",
    "0299": "ノズパス",
    "0300": "エネコ",
    "0301": "エネコロロ",
    "0302": "ヤミラミ",
    "0303": "クチート",
    "0304": "ココドラ",
    "0305": "コドラ",
    "0306": "ボスゴドラ",
    "0307": "アサナン",
    "0308": "チャーレム",
    "0309": "ラクライ",
    "0310": "ライボルト",
    "0311": "プラスル",
    "0312": "マイナン",
    "0313": "バルビート",
    "0314": "イルミーゼ",
    "0315": "ロゼリア",
    "0316": "ゴクリン",
    "0317": "マルノーム",
    "0318": "キバニア",
    "0319": "サメハダー",
    "0320": "ホエルコ",
    "0321": "ホエルオー",
    "0322": "ドンメル",
    "0323": "バクーダ",
    "0324": "コータス",
    "0325": "バネブー",
    "0326": "ブーピッグ",
    "0327": "パッチール",
    "0328": "ナックラー",
    "0329": "ビブラーバ",
    "0330": "フライゴン",
    "0331": "サボネア",
    "0332": "ノクタス",
    "0333": "チルット",
    "0334": "チルタリス",
    "0335": "ザングース",
    "0336": "ハブネーク",
    "0337": "ルナトーン",
    "0338": "ソルロック",
    "0339": "ドジョッチ",
    "0340": "ナマズン",
    "0341": "ヘイガニ",
    "0342": "シザリガー",
    "0343": "ヤジロン",
    "0344": "ネンドール",
    "0345": "リリーラ",
    "0346": "ユレイドル",
    "0347": "アノプス",
    "0348": "アーマルド",
    "0349": "ヒンバス",
    "0350": "ミロカロス",
    "0351": "ポワルン",
    "0352": "カクレオン",
    "0353": "カゲボウズ",
    "0354": "ジュペッタ",
    "0355": "ヨマワル",
    "0356": "サマヨール",
    "0357": "トロピウス",
    "0358": "チリーン",
    "0359": "アブソル",
    "0360": "ソーナノ",
    "0361": "ユキワラシ",
    "0362": "オニゴーリ",
    "0363": "タマザラシ",
    "0364": "トドグラー",
    "0365": "トドゼルガ",
    "0366": "パールル",
    "0367": "ハンテール",
    "0368": "サクラビス",
    "0369": "ジーランス",
    "0370": "ラブカス",
    "0371": "タツベイ",
    "0372": "コモルー",
    "0373": "ボーマンダ",
    "0374": "ダンバル",
    "0375": "メタング",
    "0376": "メタグロス",
    "0377": "レジロック",
    "0378": "レジアイス",
    "0379": "レジスチル",
    "0380": "ラティアス",
    "0381": "ラティオス",
    "0382": "カイオーガ",
    "0383": "グラードン",
    "0384": "レックウザ",
    "0385": "ジラーチ",
    "0386": "デオキシス",
    "0387": "ナエトル",
    "0388": "ハヤシガメ",
    "0389": "ドダイトス",
    "0390": "ヒコザル",
    "0391": "モウカザル",
    "0392": "ゴウカザル",
    "0393": "ポッチャマ",
    "0394": "ポッタイシ",
    "0395": "エンペルト",
    "0396": "ムックル",
    "0397": "ムクバード",
    "0398": "ムクホーク",
    "0399": "ビッパ",
    "0400": "ビーダル",
    "0401": "コロボーシ",
    "0402": "コロトック",
    "0403": "コリンク",
    "0404": "ルクシオ",
    "0405": "レントラー",
    "0406": "スボミー",
    "0407": "ロズレイド",
    "0408": "ズガイドス",
    "0409": "ラムパルド",
    "0410": "タテトプス",
    "0411": "トリデプス",
    "0412": "ミノムッチ",
    "0413": "ミノマダム",
    "0414": "ガーメイル",
    "0415": "ミツハニー",
    "0416": "ビークイン",
    "0417": "パチリス",
    "0418": "ブイゼル",
    "0419": "フローゼル",
    "0420": "チェリンボ",
    "0421": "チェリム",
    "0422": "カラナクシ",
    "0423": "トリトドン",
    "0424": "エテボース",
    "0425": "フワンテ",
    "0426": "フワライド",
    "0427": "ミミロル",
    "0428": "ミミロップ",
    "0429": "ムウマージ",
    "0430": "ドンカラス",
    "0431": "ニャルマー",
    "0432": "ブニャット",
    "0433": "リーシャン",
    "0434": "スカンプー",
    "0435": "スカタンク",
    "0436": "ドーミラー",
    "0437": "ドータクン",
    "0438": "ウソハチ",
    "0439": "マネネ",
    "0440": "ピンプク",
    "0441": "ペラップ",
    "0442": "ミカルゲ",
    "0443": "フカマル",
    "0444": "ガバイト",
    "0445": "ガブリアス",
    "0446": "ゴンベ",
    "0447": "リオル",
    "0448": "ルカリオ",
    "0449": "ヒポポタス",
    "0450": "カバルドン",
    "0451": "スコルピ",
    "0452": "ドラピオン",
    "0453": "グレッグル",
    "0454": "ドクロッグ",
    "0455": "マスキッパ",
    "0456": "ケイコウオ",
    "0457": "ネオラント",
    "0458": "タマンタ",
    "0459": "ユキカブリ",
    "0460": "ユキノオー",
    "0461": "マニューラ",
    "0462": "ジバコイル",
    "0463": "ベロベルト",
    "0464": "ドサイドン",
    "0465": "モジャンボ",
    "0466": "エレキブル",
    "0467": "ブーバーン",
    "0468": "トゲキッス",
    "0469": "メガヤンマ",
    "0470": "リーフィア",
    "0471": "グレイシア",
    "0472": "グライオン",
    "0473": "マンムー",
    "0474": "ポリゴンＺ",
    "0475": "エルレイド",
    "0476": "ダイノーズ",
    "0477": "ヨノワール",
    "0478": "ユキメノコ",
    "0479": "ロトム",
    "0480": "ユクシー",
    "0481": "エムリット",
    "0482": "アグノム",
    "0483": "ディアルガ",
    "0484": "パルキア",
    "0485": "ヒードラン",
    "0486": "レジギガス",
    "0487": "ギラティナ",
    "0488": "クレセリア",
    "0489": "フィオネ",
    "0490": "マナフィ",
    "0491": "ダークライ",
    "0492": "シェイミ",
    "0493": "アルセウス",
    "0494": "ビクティニ",
    "0495": "ツタージャ",
    "0496": "ジャノビー",
    "0497": "ジャローダ",
    "0498": "ポカブ",
    "0499": "チャオブー",
    "0500": "エンブオー",
    "0501": "ミジュマル",
    "0502": "フタチマル",
    "0503": "ダイケンキ",
    "0504": "ミネズミ",
    "0505": "ミルホッグ",
    "0506": "ヨーテリー",
    "0507": "ハーデリア",
    "0508": "ムーランド",
    "0509": "チョロネコ",
    "0510": "レパルダス",
    "0511": "ヤナップ",
    "0512": "ヤナッキー",
    "0513": "バオップ",
    "0514": "バオッキー",
    "0515": "ヒヤップ",
    "0516": "ヒヤッキー",
    "0517": "ムンナ",
    "0518": "ムシャーナ",
    "0519": "マメパト",
    "0520": "ハトーボー",
    "0521": "ケンホロウ",
    "0522": "シママ",
    "0523": "ゼブライカ",
    "0524": "ダンゴロ",
    "0525": "ガントル",
    "0526": "ギガイアス",
    "0527": "コロモリ",
    "0528": "ココロモリ",
    "0529": "モグリュー",
    "0530": "ドリュウズ",
    "0531": "タブンネ",
    "0532": "ドッコラー",
    "0533": "ドテッコツ",
    "0534": "ローブシン",
    "0535": "オタマロ",
    "0536": "ガマガル",
    "0537": "ガマゲロゲ",
    "0538": "ナゲキ",
    "0539": "ダゲキ",
    "0540": "クルミル",
    "0541": "クルマユ",
    "0542": "ハハコモリ",
    "0543": "フシデ",
    "0544": "ホイーガ",
    "0545": "ペンドラー",
    "0546": "モンメン",
    "0547": "エルフーン",
    "0548": "チュリネ",
    "0549": "ドレディア",
    "0550": "バスラオ",
    "0551": "メグロコ",
    "0552": "ワルビル",
    "0553": "ワルビアル",
    "0554": "ダルマッカ",
    "0555": "ヒヒダルマ",
    "0556": "マラカッチ",
    "0557": "イシズマイ",
    "0558": "イワパレス",
    "0559": "ズルッグ",
    "0560": "ズルズキン",
    "0561": "シンボラー",
    "0562": "デスマス",
    "0563": "デスカーン",
    "0564": "プロトーガ",
    "0565": "アバゴーラ",
    "0566": "アーケン",
    "0567": "アーケオス",
    "0568": "ヤブクロン",
    "0569": "ダストダス",
    "0570": "ゾロア",
    "0571": "ゾロアーク",
    "0572": "チラーミィ",
    "0573": "チラチーノ",
    "0574": "ゴチム",
    "0575": "ゴチミル",
    "0576": "ゴチルゼル",
    "0577": "ユニラン",
    "0578": "ダブラン",
    "0579": "ランクルス",
    "0580": "コアルヒー",
    "0581": "スワンナ",
    "0582": "バニプッチ",
    "0583": "バニリッチ",
    "0584": "バイバニラ",
    "0585": "シキジカ",
    "0586": "メブキジカ",
    "0587": "エモンガ",
    "0588": "カブルモ",
    "0589": "シュバルゴ",
    "0590": "タマゲタケ",
    "0591": "モロバレル",
    "0592": "プルリル",
    "0593": "ブルンゲル",
    "0594": "ママンボウ",
    "0595": "バチュル",
    "0596": "デンチュラ",
    "0597": "テッシード",
    "0598": "ナットレイ",
    "0599": "ギアル",
    "0600": "ギギアル",
    "0601": "ギギギアル",
    "0602": "シビシラス",
    "0603": "シビビール",
    "0604": "シビルドン",
    "0605": "リグレー",
    "0606": "オーベム",
    "0607": "ヒトモシ",
    "0608": "ランプラー",
    "0609": "シャンデラ",
    "0610": "キバゴ",
    "0611": "オノンド",
    "0612": "オノノクス",
    "0613": "クマシュン",
    "0614": "ツンベアー",
    "0615": "フリージオ",
    "0616": "チョボマキ",
    "0617": "アギルダー",
    "0618": "マッギョ",
    "0619": "コジョフー",
    "0620": "コジョンド",
    "0621": "クリムガン",
    "0622": "ゴビット",
    "0623": "ゴルーグ",
    "0624": "コマタナ",
    "0625": "キリキザン",
    "0626": "バッフロン",
    "0627": "ワシボン",
    "0628": "ウォーグル",
    "0629": "バルチャイ",
    "0630": "バルジーナ",
    "0631": "クイタラン",
    "0632": "アイアント",
    "0633": "モノズ",
    "0634": "ジヘッド",
    "0635": "サザンドラ",
    "0636": "メラルバ",
    "0637": "ウルガモス",
    "0638": "コバルオン",
    "0639": "テラキオン",
    "0640": "ビリジオン",
    "0641": "トルネロス",
    "0642": "ボルトロス",
    "0643": "レシラム",
    "0644": "ゼクロム",
    "0645": "ランドロス",
    "0646": "キュレム",
    "0647": "ケルディオ",
    "0648": "メロエッタ",
    "0649": "ゲノセクト"
}

const pokeTypesList = {
    "0001": [
        "grass",
        "poison"
    ],
    "0002": [
        "grass",
        "poison"
    ],
    "0003": [
        "grass",
        "poison"
    ],
    "0004": [
        "fire",
        "fire"
    ],
    "0005": [
        "fire",
        "fire"
    ],
    "0006": [
        "fire",
        "flying"
    ],
    "0007": [
        "water",
        "water"
    ],
    "0008": [
        "water",
        "water"
    ],
    "0009": [
        "water",
        "water"
    ],
    "0010": [
        "bug",
        "bug"
    ],
    "0011": [
        "bug",
        "bug"
    ],
    "0012": [
        "bug",
        "flying"
    ],
    "0013": [
        "bug",
        "poison"
    ],
    "0014": [
        "bug",
        "poison"
    ],
    "0015": [
        "bug",
        "poison"
    ],
    "0016": [
        "normal",
        "flying"
    ],
    "0017": [
        "normal",
        "flying"
    ],
    "0018": [
        "normal",
        "flying"
    ],
    "0019": [
        "normal",
        "normal"
    ],
    "0020": [
        "normal",
        "normal"
    ],
    "0021": [
        "normal",
        "flying"
    ],
    "0022": [
        "normal",
        "flying"
    ],
    "0023": [
        "poison",
        "poison"
    ],
    "0024": [
        "poison",
        "poison"
    ],
    "0025": [
        "electric",
        "electric"
    ],
    "0026": [
        "electric",
        "electric"
    ],
    "0027": [
        "ground",
        "ground"
    ],
    "0028": [
        "ground",
        "ground"
    ],
    "0029": [
        "poison",
        "poison"
    ],
    "0030": [
        "poison",
        "poison"
    ],
    "0031": [
        "poison",
        "ground"
    ],
    "0032": [
        "poison",
        "poison"
    ],
    "0033": [
        "poison",
        "poison"
    ],
    "0034": [
        "poison",
        "ground"
    ],
    "0035": [
        "fairy",
        "fairy"
    ],
    "0036": [
        "fairy",
        "fairy"
    ],
    "0037": [
        "fire",
        "fire"
    ],
    "0038": [
        "fire",
        "fire"
    ],
    "0039": [
        "normal",
        "fairy"
    ],
    "0040": [
        "normal",
        "fairy"
    ],
    "0041": [
        "poison",
        "flying"
    ],
    "0042": [
        "poison",
        "flying"
    ],
    "0043": [
        "grass",
        "poison"
    ],
    "0044": [
        "grass",
        "poison"
    ],
    "0045": [
        "grass",
        "poison"
    ],
    "0046": [
        "bug",
        "grass"
    ],
    "0047": [
        "bug",
        "grass"
    ],
    "0048": [
        "bug",
        "poison"
    ],
    "0049": [
        "bug",
        "poison"
    ],
    "0050": [
        "ground",
        "ground"
    ],
    "0051": [
        "ground",
        "ground"
    ],
    "0052": [
        "normal",
        "normal"
    ],
    "0053": [
        "normal",
        "normal"
    ],
    "0054": [
        "water",
        "water"
    ],
    "0055": [
        "water",
        "water"
    ],
    "0056": [
        "fighting",
        "fighting"
    ],
    "0057": [
        "fighting",
        "fighting"
    ],
    "0058": [
        "fire",
        "fire"
    ],
    "0059": [
        "fire",
        "fire"
    ],
    "0060": [
        "water",
        "water"
    ],
    "0061": [
        "water",
        "water"
    ],
    "0062": [
        "water",
        "fighting"
    ],
    "0063": [
        "psychic",
        "psychic"
    ],
    "0064": [
        "psychic",
        "psychic"
    ],
    "0065": [
        "psychic",
        "psychic"
    ],
    "0066": [
        "fighting",
        "fighting"
    ],
    "0067": [
        "fighting",
        "fighting"
    ],
    "0068": [
        "fighting",
        "fighting"
    ],
    "0069": [
        "grass",
        "poison"
    ],
    "0070": [
        "grass",
        "poison"
    ],
    "0071": [
        "grass",
        "poison"
    ],
    "0072": [
        "water",
        "poison"
    ],
    "0073": [
        "water",
        "poison"
    ],
    "0074": [
        "rock",
        "ground"
    ],
    "0075": [
        "rock",
        "ground"
    ],
    "0076": [
        "rock",
        "ground"
    ],
    "0077": [
        "fire",
        "fire"
    ],
    "0078": [
        "fire",
        "fire"
    ],
    "0079": [
        "water",
        "psychic"
    ],
    "0080": [
        "water",
        "psychic"
    ],
    "0081": [
        "electric",
        "steel"
    ],
    "0082": [
        "electric",
        "steel"
    ],
    "0083": [
        "normal",
        "flying"
    ],
    "0084": [
        "normal",
        "flying"
    ],
    "0085": [
        "normal",
        "flying"
    ],
    "0086": [
        "water",
        "water"
    ],
    "0087": [
        "water",
        "ice"
    ],
    "0088": [
        "poison",
        "poison"
    ],
    "0089": [
        "poison",
        "poison"
    ],
    "0090": [
        "water",
        "water"
    ],
    "0091": [
        "water",
        "ice"
    ],
    "0092": [
        "ghost",
        "poison"
    ],
    "0093": [
        "ghost",
        "poison"
    ],
    "0094": [
        "ghost",
        "poison"
    ],
    "0095": [
        "rock",
        "ground"
    ],
    "0096": [
        "psychic",
        "psychic"
    ],
    "0097": [
        "psychic",
        "psychic"
    ],
    "0098": [
        "water",
        "water"
    ],
    "0099": [
        "water",
        "water"
    ],
    "0100": [
        "electric",
        "electric"
    ],
    "0101": [
        "electric",
        "electric"
    ],
    "0102": [
        "grass",
        "psychic"
    ],
    "0103": [
        "grass",
        "psychic"
    ],
    "0104": [
        "ground",
        "ground"
    ],
    "0105": [
        "ground",
        "ground"
    ],
    "0106": [
        "fighting",
        "fighting"
    ],
    "0107": [
        "fighting",
        "fighting"
    ],
    "0108": [
        "normal",
        "normal"
    ],
    "0109": [
        "poison",
        "poison"
    ],
    "0110": [
        "poison",
        "poison"
    ],
    "0111": [
        "ground",
        "rock"
    ],
    "0112": [
        "ground",
        "rock"
    ],
    "0113": [
        "normal",
        "normal"
    ],
    "0114": [
        "grass",
        "grass"
    ],
    "0115": [
        "normal",
        "normal"
    ],
    "0116": [
        "water",
        "water"
    ],
    "0117": [
        "water",
        "water"
    ],
    "0118": [
        "water",
        "water"
    ],
    "0119": [
        "water",
        "water"
    ],
    "0120": [
        "water",
        "water"
    ],
    "0121": [
        "water",
        "psychic"
    ],
    "0122": [
        "psychic",
        "fairy"
    ],
    "0123": [
        "bug",
        "flying"
    ],
    "0124": [
        "ice",
        "psychic"
    ],
    "0125": [
        "electric",
        "electric"
    ],
    "0126": [
        "fire",
        "fire"
    ],
    "0127": [
        "bug",
        "bug"
    ],
    "0128": [
        "normal",
        "normal"
    ],
    "0129": [
        "water",
        "water"
    ],
    "0130": [
        "water",
        "flying"
    ],
    "0131": [
        "water",
        "ice"
    ],
    "0132": [
        "normal",
        "normal"
    ],
    "0133": [
        "normal",
        "normal"
    ],
    "0134": [
        "water",
        "water"
    ],
    "0135": [
        "electric",
        "electric"
    ],
    "0136": [
        "fire",
        "fire"
    ],
    "0137": [
        "normal",
        "normal"
    ],
    "0138": [
        "rock",
        "water"
    ],
    "0139": [
        "rock",
        "water"
    ],
    "0140": [
        "rock",
        "water"
    ],
    "0141": [
        "rock",
        "water"
    ],
    "0142": [
        "rock",
        "flying"
    ],
    "0143": [
        "normal",
        "normal"
    ],
    "0144": [
        "ice",
        "flying"
    ],
    "0145": [
        "electric",
        "flying"
    ],
    "0146": [
        "fire",
        "flying"
    ],
    "0147": [
        "dragon",
        "dragon"
    ],
    "0148": [
        "dragon",
        "dragon"
    ],
    "0149": [
        "dragon",
        "flying"
    ],
    "0150": [
        "psychic",
        "psychic"
    ],
    "0151": [
        "psychic",
        "psychic"
    ],
    "0152": [
        "grass",
        "grass"
    ],
    "0153": [
        "grass",
        "grass"
    ],
    "0154": [
        "grass",
        "grass"
    ],
    "0155": [
        "fire",
        "fire"
    ],
    "0156": [
        "fire",
        "fire"
    ],
    "0157": [
        "fire",
        "fire"
    ],
    "0158": [
        "water",
        "water"
    ],
    "0159": [
        "water",
        "water"
    ],
    "0160": [
        "water",
        "water"
    ],
    "0161": [
        "normal",
        "normal"
    ],
    "0162": [
        "normal",
        "normal"
    ],
    "0163": [
        "normal",
        "flying"
    ],
    "0164": [
        "normal",
        "flying"
    ],
    "0165": [
        "bug",
        "flying"
    ],
    "0166": [
        "bug",
        "flying"
    ],
    "0167": [
        "bug",
        "poison"
    ],
    "0168": [
        "bug",
        "poison"
    ],
    "0169": [
        "poison",
        "flying"
    ],
    "0170": [
        "water",
        "electric"
    ],
    "0171": [
        "water",
        "electric"
    ],
    "0172": [
        "electric",
        "electric"
    ],
    "0173": [
        "fairy",
        "fairy"
    ],
    "0174": [
        "normal",
        "fairy"
    ],
    "0175": [
        "fairy",
        "fairy"
    ],
    "0176": [
        "fairy",
        "flying"
    ],
    "0177": [
        "psychic",
        "flying"
    ],
    "0178": [
        "psychic",
        "flying"
    ],
    "0179": [
        "electric",
        "electric"
    ],
    "0180": [
        "electric",
        "electric"
    ],
    "0181": [
        "electric",
        "electric"
    ],
    "0182": [
        "grass",
        "grass"
    ],
    "0183": [
        "water",
        "fairy"
    ],
    "0184": [
        "water",
        "fairy"
    ],
    "0185": [
        "rock",
        "rock"
    ],
    "0186": [
        "water",
        "water"
    ],
    "0187": [
        "grass",
        "flying"
    ],
    "0188": [
        "grass",
        "flying"
    ],
    "0189": [
        "grass",
        "flying"
    ],
    "0190": [
        "normal",
        "normal"
    ],
    "0191": [
        "grass",
        "grass"
    ],
    "0192": [
        "grass",
        "grass"
    ],
    "0193": [
        "bug",
        "flying"
    ],
    "0194": [
        "water",
        "ground"
    ],
    "0195": [
        "water",
        "ground"
    ],
    "0196": [
        "psychic",
        "psychic"
    ],
    "0197": [
        "dark",
        "dark"
    ],
    "0198": [
        "dark",
        "flying"
    ],
    "0199": [
        "water",
        "psychic"
    ],
    "0200": [
        "ghost",
        "ghost"
    ],
    "0201": [
        "psychic",
        "psychic"
    ],
    "0202": [
        "psychic",
        "psychic"
    ],
    "0203": [
        "normal",
        "psychic"
    ],
    "0204": [
        "bug",
        "bug"
    ],
    "0205": [
        "bug",
        "steel"
    ],
    "0206": [
        "normal",
        "normal"
    ],
    "0207": [
        "ground",
        "flying"
    ],
    "0208": [
        "steel",
        "ground"
    ],
    "0209": [
        "fairy",
        "fairy"
    ],
    "0210": [
        "fairy",
        "fairy"
    ],
    "0211": [
        "water",
        "poison"
    ],
    "0212": [
        "bug",
        "steel"
    ],
    "0213": [
        "bug",
        "rock"
    ],
    "0214": [
        "bug",
        "fighting"
    ],
    "0215": [
        "dark",
        "ice"
    ],
    "0216": [
        "normal",
        "normal"
    ],
    "0217": [
        "normal",
        "normal"
    ],
    "0218": [
        "fire",
        "fire"
    ],
    "0219": [
        "fire",
        "rock"
    ],
    "0220": [
        "ice",
        "ground"
    ],
    "0221": [
        "ice",
        "ground"
    ],
    "0222": [
        "water",
        "rock"
    ],
    "0223": [
        "water",
        "water"
    ],
    "0224": [
        "water",
        "water"
    ],
    "0225": [
        "ice",
        "flying"
    ],
    "0226": [
        "water",
        "flying"
    ],
    "0227": [
        "steel",
        "flying"
    ],
    "0228": [
        "dark",
        "fire"
    ],
    "0229": [
        "dark",
        "fire"
    ],
    "0230": [
        "water",
        "dragon"
    ],
    "0231": [
        "ground",
        "ground"
    ],
    "0232": [
        "ground",
        "ground"
    ],
    "0233": [
        "normal",
        "normal"
    ],
    "0234": [
        "normal",
        "normal"
    ],
    "0235": [
        "normal",
        "normal"
    ],
    "0236": [
        "fighting",
        "fighting"
    ],
    "0237": [
        "fighting",
        "fighting"
    ],
    "0238": [
        "ice",
        "psychic"
    ],
    "0239": [
        "electric",
        "electric"
    ],
    "0240": [
        "fire",
        "fire"
    ],
    "0241": [
        "normal",
        "normal"
    ],
    "0242": [
        "normal",
        "normal"
    ],
    "0243": [
        "electric",
        "electric"
    ],
    "0244": [
        "fire",
        "fire"
    ],
    "0245": [
        "water",
        "water"
    ],
    "0246": [
        "rock",
        "ground"
    ],
    "0247": [
        "rock",
        "ground"
    ],
    "0248": [
        "rock",
        "dark"
    ],
    "0249": [
        "psychic",
        "flying"
    ],
    "0250": [
        "fire",
        "flying"
    ],
    "0251": [
        "psychic",
        "grass"
    ],
    "0252": [
        "grass",
        "grass"
    ],
    "0253": [
        "grass",
        "grass"
    ],
    "0254": [
        "grass",
        "grass"
    ],
    "0255": [
        "fire",
        "fire"
    ],
    "0256": [
        "fire",
        "fighting"
    ],
    "0257": [
        "fire",
        "fighting"
    ],
    "0258": [
        "water",
        "water"
    ],
    "0259": [
        "water",
        "ground"
    ],
    "0260": [
        "water",
        "ground"
    ],
    "0261": [
        "dark",
        "dark"
    ],
    "0262": [
        "dark",
        "dark"
    ],
    "0263": [
        "normal",
        "normal"
    ],
    "0264": [
        "normal",
        "normal"
    ],
    "0265": [
        "bug",
        "bug"
    ],
    "0266": [
        "bug",
        "bug"
    ],
    "0267": [
        "bug",
        "flying"
    ],
    "0268": [
        "bug",
        "bug"
    ],
    "0269": [
        "bug",
        "poison"
    ],
    "0270": [
        "water",
        "grass"
    ],
    "0271": [
        "water",
        "grass"
    ],
    "0272": [
        "water",
        "grass"
    ],
    "0273": [
        "grass",
        "grass"
    ],
    "0274": [
        "grass",
        "dark"
    ],
    "0275": [
        "grass",
        "dark"
    ],
    "0276": [
        "normal",
        "flying"
    ],
    "0277": [
        "normal",
        "flying"
    ],
    "0278": [
        "water",
        "flying"
    ],
    "0279": [
        "water",
        "flying"
    ],
    "0280": [
        "psychic",
        "fairy"
    ],
    "0281": [
        "psychic",
        "fairy"
    ],
    "0282": [
        "psychic",
        "fairy"
    ],
    "0283": [
        "bug",
        "water"
    ],
    "0284": [
        "bug",
        "flying"
    ],
    "0285": [
        "grass",
        "grass"
    ],
    "0286": [
        "grass",
        "fighting"
    ],
    "0287": [
        "normal",
        "normal"
    ],
    "0288": [
        "normal",
        "normal"
    ],
    "0289": [
        "normal",
        "normal"
    ],
    "0290": [
        "bug",
        "ground"
    ],
    "0291": [
        "bug",
        "flying"
    ],
    "0292": [
        "bug",
        "ghost"
    ],
    "0293": [
        "normal",
        "normal"
    ],
    "0294": [
        "normal",
        "normal"
    ],
    "0295": [
        "normal",
        "normal"
    ],
    "0296": [
        "fighting",
        "fighting"
    ],
    "0297": [
        "fighting",
        "fighting"
    ],
    "0298": [
        "normal",
        "fairy"
    ],
    "0299": [
        "rock",
        "rock"
    ],
    "0300": [
        "normal",
        "normal"
    ],
    "0301": [
        "normal",
        "normal"
    ],
    "0302": [
        "dark",
        "ghost"
    ],
    "0303": [
        "steel",
        "fairy"
    ],
    "0304": [
        "steel",
        "rock"
    ],
    "0305": [
        "steel",
        "rock"
    ],
    "0306": [
        "steel",
        "rock"
    ],
    "0307": [
        "fighting",
        "psychic"
    ],
    "0308": [
        "fighting",
        "psychic"
    ],
    "0309": [
        "electric",
        "electric"
    ],
    "0310": [
        "electric",
        "electric"
    ],
    "0311": [
        "electric",
        "electric"
    ],
    "0312": [
        "electric",
        "electric"
    ],
    "0313": [
        "bug",
        "bug"
    ],
    "0314": [
        "bug",
        "bug"
    ],
    "0315": [
        "grass",
        "poison"
    ],
    "0316": [
        "poison",
        "poison"
    ],
    "0317": [
        "poison",
        "poison"
    ],
    "0318": [
        "water",
        "dark"
    ],
    "0319": [
        "water",
        "dark"
    ],
    "0320": [
        "water",
        "water"
    ],
    "0321": [
        "water",
        "water"
    ],
    "0322": [
        "fire",
        "ground"
    ],
    "0323": [
        "fire",
        "ground"
    ],
    "0324": [
        "fire",
        "fire"
    ],
    "0325": [
        "psychic",
        "psychic"
    ],
    "0326": [
        "psychic",
        "psychic"
    ],
    "0327": [
        "normal",
        "normal"
    ],
    "0328": [
        "ground",
        "ground"
    ],
    "0329": [
        "ground",
        "dragon"
    ],
    "0330": [
        "ground",
        "dragon"
    ],
    "0331": [
        "grass",
        "grass"
    ],
    "0332": [
        "grass",
        "dark"
    ],
    "0333": [
        "normal",
        "flying"
    ],
    "0334": [
        "dragon",
        "flying"
    ],
    "0335": [
        "normal",
        "normal"
    ],
    "0336": [
        "poison",
        "poison"
    ],
    "0337": [
        "rock",
        "psychic"
    ],
    "0338": [
        "rock",
        "psychic"
    ],
    "0339": [
        "water",
        "ground"
    ],
    "0340": [
        "water",
        "ground"
    ],
    "0341": [
        "water",
        "water"
    ],
    "0342": [
        "water",
        "dark"
    ],
    "0343": [
        "ground",
        "psychic"
    ],
    "0344": [
        "ground",
        "psychic"
    ],
    "0345": [
        "rock",
        "grass"
    ],
    "0346": [
        "rock",
        "grass"
    ],
    "0347": [
        "rock",
        "bug"
    ],
    "0348": [
        "rock",
        "bug"
    ],
    "0349": [
        "water",
        "water"
    ],
    "0350": [
        "water",
        "water"
    ],
    "0351": [
        "normal",
        "normal"
    ],
    "0352": [
        "normal",
        "normal"
    ],
    "0353": [
        "ghost",
        "ghost"
    ],
    "0354": [
        "ghost",
        "ghost"
    ],
    "0355": [
        "ghost",
        "ghost"
    ],
    "0356": [
        "ghost",
        "ghost"
    ],
    "0357": [
        "grass",
        "flying"
    ],
    "0358": [
        "psychic",
        "psychic"
    ],
    "0359": [
        "dark",
        "dark"
    ],
    "0360": [
        "psychic",
        "psychic"
    ],
    "0361": [
        "ice",
        "ice"
    ],
    "0362": [
        "ice",
        "ice"
    ],
    "0363": [
        "ice",
        "water"
    ],
    "0364": [
        "ice",
        "water"
    ],
    "0365": [
        "ice",
        "water"
    ],
    "0366": [
        "water",
        "water"
    ],
    "0367": [
        "water",
        "water"
    ],
    "0368": [
        "water",
        "water"
    ],
    "0369": [
        "water",
        "rock"
    ],
    "0370": [
        "water",
        "water"
    ],
    "0371": [
        "dragon",
        "dragon"
    ],
    "0372": [
        "dragon",
        "dragon"
    ],
    "0373": [
        "dragon",
        "flying"
    ],
    "0374": [
        "steel",
        "psychic"
    ],
    "0375": [
        "steel",
        "psychic"
    ],
    "0376": [
        "steel",
        "psychic"
    ],
    "0377": [
        "rock",
        "rock"
    ],
    "0378": [
        "ice",
        "ice"
    ],
    "0379": [
        "steel",
        "steel"
    ],
    "0380": [
        "dragon",
        "psychic"
    ],
    "0381": [
        "dragon",
        "psychic"
    ],
    "0382": [
        "water",
        "water"
    ],
    "0383": [
        "ground",
        "ground"
    ],
    "0384": [
        "dragon",
        "flying"
    ],
    "0385": [
        "steel",
        "psychic"
    ],
    "0386": [
        "psychic",
        "psychic"
    ],
    "0387": [
        "grass",
        "grass"
    ],
    "0388": [
        "grass",
        "grass"
    ],
    "0389": [
        "grass",
        "ground"
    ],
    "0390": [
        "fire",
        "fire"
    ],
    "0391": [
        "fire",
        "fighting"
    ],
    "0392": [
        "fire",
        "fighting"
    ],
    "0393": [
        "water",
        "water"
    ],
    "0394": [
        "water",
        "water"
    ],
    "0395": [
        "water",
        "steel"
    ],
    "0396": [
        "normal",
        "flying"
    ],
    "0397": [
        "normal",
        "flying"
    ],
    "0398": [
        "normal",
        "flying"
    ],
    "0399": [
        "normal",
        "normal"
    ],
    "0400": [
        "normal",
        "water"
    ],
    "0401": [
        "bug",
        "bug"
    ],
    "0402": [
        "bug",
        "bug"
    ],
    "0403": [
        "electric",
        "electric"
    ],
    "0404": [
        "electric",
        "electric"
    ],
    "0405": [
        "electric",
        "electric"
    ],
    "0406": [
        "grass",
        "poison"
    ],
    "0407": [
        "grass",
        "poison"
    ],
    "0408": [
        "rock",
        "rock"
    ],
    "0409": [
        "rock",
        "rock"
    ],
    "0410": [
        "rock",
        "steel"
    ],
    "0411": [
        "rock",
        "steel"
    ],
    "0412": [
        "bug",
        "bug"
    ],
    "0413": [
        "bug",
        "grass"
    ],
    "0414": [
        "bug",
        "flying"
    ],
    "0415": [
        "bug",
        "flying"
    ],
    "0416": [
        "bug",
        "flying"
    ],
    "0417": [
        "electric",
        "electric"
    ],
    "0418": [
        "water",
        "water"
    ],
    "0419": [
        "water",
        "water"
    ],
    "0420": [
        "grass",
        "grass"
    ],
    "0421": [
        "grass",
        "grass"
    ],
    "0422": [
        "water",
        "water"
    ],
    "0423": [
        "water",
        "ground"
    ],
    "0424": [
        "normal",
        "normal"
    ],
    "0425": [
        "ghost",
        "flying"
    ],
    "0426": [
        "ghost",
        "flying"
    ],
    "0427": [
        "normal",
        "normal"
    ],
    "0428": [
        "normal",
        "normal"
    ],
    "0429": [
        "ghost",
        "ghost"
    ],
    "0430": [
        "dark",
        "flying"
    ],
    "0431": [
        "normal",
        "normal"
    ],
    "0432": [
        "normal",
        "normal"
    ],
    "0433": [
        "psychic",
        "psychic"
    ],
    "0434": [
        "poison",
        "dark"
    ],
    "0435": [
        "poison",
        "dark"
    ],
    "0436": [
        "steel",
        "psychic"
    ],
    "0437": [
        "steel",
        "psychic"
    ],
    "0438": [
        "rock",
        "rock"
    ],
    "0439": [
        "psychic",
        "fairy"
    ],
    "0440": [
        "normal",
        "normal"
    ],
    "0441": [
        "normal",
        "flying"
    ],
    "0442": [
        "ghost",
        "dark"
    ],
    "0443": [
        "dragon",
        "ground"
    ],
    "0444": [
        "dragon",
        "ground"
    ],
    "0445": [
        "dragon",
        "ground"
    ],
    "0446": [
        "normal",
        "normal"
    ],
    "0447": [
        "fighting",
        "fighting"
    ],
    "0448": [
        "fighting",
        "steel"
    ],
    "0449": [
        "ground",
        "ground"
    ],
    "0450": [
        "ground",
        "ground"
    ],
    "0451": [
        "poison",
        "bug"
    ],
    "0452": [
        "poison",
        "dark"
    ],
    "0453": [
        "poison",
        "fighting"
    ],
    "0454": [
        "poison",
        "fighting"
    ],
    "0455": [
        "grass",
        "grass"
    ],
    "0456": [
        "water",
        "water"
    ],
    "0457": [
        "water",
        "water"
    ],
    "0458": [
        "water",
        "flying"
    ],
    "0459": [
        "grass",
        "ice"
    ],
    "0460": [
        "grass",
        "ice"
    ],
    "0461": [
        "dark",
        "ice"
    ],
    "0462": [
        "electric",
        "steel"
    ],
    "0463": [
        "normal",
        "normal"
    ],
    "0464": [
        "ground",
        "rock"
    ],
    "0465": [
        "grass",
        "grass"
    ],
    "0466": [
        "electric",
        "electric"
    ],
    "0467": [
        "fire",
        "fire"
    ],
    "0468": [
        "fairy",
        "flying"
    ],
    "0469": [
        "bug",
        "flying"
    ],
    "0470": [
        "grass",
        "grass"
    ],
    "0471": [
        "ice",
        "ice"
    ],
    "0472": [
        "ground",
        "flying"
    ],
    "0473": [
        "ice",
        "ground"
    ],
    "0474": [
        "normal",
        "normal"
    ],
    "0475": [
        "psychic",
        "fighting"
    ],
    "0476": [
        "rock",
        "steel"
    ],
    "0477": [
        "ghost",
        "ghost"
    ],
    "0478": [
        "ice",
        "ghost"
    ],
    "0479": [
        "electric",
        "ghost"
    ],
    "0480": [
        "psychic",
        "psychic"
    ],
    "0481": [
        "psychic",
        "psychic"
    ],
    "0482": [
        "psychic",
        "psychic"
    ],
    "0483": [
        "steel",
        "dragon"
    ],
    "0484": [
        "water",
        "dragon"
    ],
    "0485": [
        "fire",
        "steel"
    ],
    "0486": [
        "normal",
        "normal"
    ],
    "0487": [
        "ghost",
        "dragon"
    ],
    "0488": [
        "psychic",
        "psychic"
    ],
    "0489": [
        "water",
        "water"
    ],
    "0490": [
        "water",
        "water"
    ],
    "0491": [
        "dark",
        "dark"
    ],
    "0492": [
        "grass",
        "grass"
    ],
    "0493": [
        "normal",
        "normal"
    ],
    "0494": [
        "psychic",
        "fire"
    ],
    "0495": [
        "grass",
        "grass"
    ],
    "0496": [
        "grass",
        "grass"
    ],
    "0497": [
        "grass",
        "grass"
    ],
    "0498": [
        "fire",
        "fire"
    ],
    "0499": [
        "fire",
        "fighting"
    ],
    "0500": [
        "fire",
        "fighting"
    ],
    "0501": [
        "water",
        "water"
    ],
    "0502": [
        "water",
        "water"
    ],
    "0503": [
        "water",
        "water"
    ],
    "0504": [
        "normal",
        "normal"
    ],
    "0505": [
        "normal",
        "normal"
    ],
    "0506": [
        "normal",
        "normal"
    ],
    "0507": [
        "normal",
        "normal"
    ],
    "0508": [
        "normal",
        "normal"
    ],
    "0509": [
        "dark",
        "dark"
    ],
    "0510": [
        "dark",
        "dark"
    ],
    "0511": [
        "grass",
        "grass"
    ],
    "0512": [
        "grass",
        "grass"
    ],
    "0513": [
        "fire",
        "fire"
    ],
    "0514": [
        "fire",
        "fire"
    ],
    "0515": [
        "water",
        "water"
    ],
    "0516": [
        "water",
        "water"
    ],
    "0517": [
        "psychic",
        "psychic"
    ],
    "0518": [
        "psychic",
        "psychic"
    ],
    "0519": [
        "normal",
        "flying"
    ],
    "0520": [
        "normal",
        "flying"
    ],
    "0521": [
        "normal",
        "flying"
    ],
    "0522": [
        "electric",
        "electric"
    ],
    "0523": [
        "electric",
        "electric"
    ],
    "0524": [
        "rock",
        "rock"
    ],
    "0525": [
        "rock",
        "rock"
    ],
    "0526": [
        "rock",
        "rock"
    ],
    "0527": [
        "psychic",
        "flying"
    ],
    "0528": [
        "psychic",
        "flying"
    ],
    "0529": [
        "ground",
        "ground"
    ],
    "0530": [
        "ground",
        "steel"
    ],
    "0531": [
        "normal",
        "normal"
    ],
    "0532": [
        "fighting",
        "fighting"
    ],
    "0533": [
        "fighting",
        "fighting"
    ],
    "0534": [
        "fighting",
        "fighting"
    ],
    "0535": [
        "water",
        "water"
    ],
    "0536": [
        "water",
        "ground"
    ],
    "0537": [
        "water",
        "ground"
    ],
    "0538": [
        "fighting",
        "fighting"
    ],
    "0539": [
        "fighting",
        "fighting"
    ],
    "0540": [
        "bug",
        "grass"
    ],
    "0541": [
        "bug",
        "grass"
    ],
    "0542": [
        "bug",
        "grass"
    ],
    "0543": [
        "bug",
        "poison"
    ],
    "0544": [
        "bug",
        "poison"
    ],
    "0545": [
        "bug",
        "poison"
    ],
    "0546": [
        "grass",
        "fairy"
    ],
    "0547": [
        "grass",
        "fairy"
    ],
    "0548": [
        "grass",
        "grass"
    ],
    "0549": [
        "grass",
        "grass"
    ],
    "0550": [
        "water",
        "water"
    ],
    "0551": [
        "ground",
        "dark"
    ],
    "0552": [
        "ground",
        "dark"
    ],
    "0553": [
        "ground",
        "dark"
    ],
    "0554": [
        "fire",
        "fire"
    ],
    "0555": [
        "fire",
        "fire"
    ],
    "0556": [
        "grass",
        "grass"
    ],
    "0557": [
        "bug",
        "rock"
    ],
    "0558": [
        "bug",
        "rock"
    ],
    "0559": [
        "dark",
        "fighting"
    ],
    "0560": [
        "dark",
        "fighting"
    ],
    "0561": [
        "psychic",
        "flying"
    ],
    "0562": [
        "ghost",
        "ghost"
    ],
    "0563": [
        "ghost",
        "ghost"
    ],
    "0564": [
        "water",
        "rock"
    ],
    "0565": [
        "water",
        "rock"
    ],
    "0566": [
        "rock",
        "flying"
    ],
    "0567": [
        "rock",
        "flying"
    ],
    "0568": [
        "poison",
        "poison"
    ],
    "0569": [
        "poison",
        "poison"
    ],
    "0570": [
        "dark",
        "dark"
    ],
    "0571": [
        "dark",
        "dark"
    ],
    "0572": [
        "normal",
        "normal"
    ],
    "0573": [
        "normal",
        "normal"
    ],
    "0574": [
        "psychic",
        "psychic"
    ],
    "0575": [
        "psychic",
        "psychic"
    ],
    "0576": [
        "psychic",
        "psychic"
    ],
    "0577": [
        "psychic",
        "psychic"
    ],
    "0578": [
        "psychic",
        "psychic"
    ],
    "0579": [
        "psychic",
        "psychic"
    ],
    "0580": [
        "water",
        "flying"
    ],
    "0581": [
        "water",
        "flying"
    ],
    "0582": [
        "ice",
        "ice"
    ],
    "0583": [
        "ice",
        "ice"
    ],
    "0584": [
        "ice",
        "ice"
    ],
    "0585": [
        "normal",
        "grass"
    ],
    "0586": [
        "normal",
        "grass"
    ],
    "0587": [
        "electric",
        "flying"
    ],
    "0588": [
        "bug",
        "bug"
    ],
    "0589": [
        "bug",
        "steel"
    ],
    "0590": [
        "grass",
        "poison"
    ],
    "0591": [
        "grass",
        "poison"
    ],
    "0592": [
        "water",
        "ghost"
    ],
    "0593": [
        "water",
        "ghost"
    ],
    "0594": [
        "water",
        "water"
    ],
    "0595": [
        "bug",
        "electric"
    ],
    "0596": [
        "bug",
        "electric"
    ],
    "0597": [
        "grass",
        "steel"
    ],
    "0598": [
        "grass",
        "steel"
    ],
    "0599": [
        "steel",
        "steel"
    ],
    "0600": [
        "steel",
        "steel"
    ],
    "0601": [
        "steel",
        "steel"
    ],
    "0602": [
        "electric",
        "electric"
    ],
    "0603": [
        "electric",
        "electric"
    ],
    "0604": [
        "electric",
        "electric"
    ],
    "0605": [
        "psychic",
        "psychic"
    ],
    "0606": [
        "psychic",
        "psychic"
    ],
    "0607": [
        "ghost",
        "fire"
    ],
    "0608": [
        "ghost",
        "fire"
    ],
    "0609": [
        "ghost",
        "fire"
    ],
    "0610": [
        "dragon",
        "dragon"
    ],
    "0611": [
        "dragon",
        "dragon"
    ],
    "0612": [
        "dragon",
        "dragon"
    ],
    "0613": [
        "ice",
        "ice"
    ],
    "0614": [
        "ice",
        "ice"
    ],
    "0615": [
        "ice",
        "ice"
    ],
    "0616": [
        "bug",
        "bug"
    ],
    "0617": [
        "bug",
        "bug"
    ],
    "0618": [
        "ground",
        "electric"
    ],
    "0619": [
        "fighting",
        "fighting"
    ],
    "0620": [
        "fighting",
        "fighting"
    ],
    "0621": [
        "dragon",
        "dragon"
    ],
    "0622": [
        "ground",
        "ghost"
    ],
    "0623": [
        "ground",
        "ghost"
    ],
    "0624": [
        "dark",
        "steel"
    ],
    "0625": [
        "dark",
        "steel"
    ],
    "0626": [
        "normal",
        "normal"
    ],
    "0627": [
        "normal",
        "flying"
    ],
    "0628": [
        "normal",
        "flying"
    ],
    "0629": [
        "dark",
        "flying"
    ],
    "0630": [
        "dark",
        "flying"
    ],
    "0631": [
        "fire",
        "fire"
    ],
    "0632": [
        "bug",
        "steel"
    ],
    "0633": [
        "dark",
        "dragon"
    ],
    "0634": [
        "dark",
        "dragon"
    ],
    "0635": [
        "dark",
        "dragon"
    ],
    "0636": [
        "bug",
        "fire"
    ],
    "0637": [
        "bug",
        "fire"
    ],
    "0638": [
        "steel",
        "fighting"
    ],
    "0639": [
        "rock",
        "fighting"
    ],
    "0640": [
        "grass",
        "fighting"
    ],
    "0641": [
        "flying",
        "flying"
    ],
    "0642": [
        "electric",
        "flying"
    ],
    "0643": [
        "dragon",
        "fire"
    ],
    "0644": [
        "dragon",
        "electric"
    ],
    "0645": [
        "ground",
        "flying"
    ],
    "0646": [
        "dragon",
        "ice"
    ],
    "0647": [
        "water",
        "fighting"
    ],
    "0648": [
        "normal",
        "psychic"
    ],
    "0649": [
        "bug",
        "steel"
    ]
}